app/Services/UploadService.php

    public function processMetadata(array $metadata): array
    {
        if (!$this->validateMetadataFields($metadata)) {
            return ['success' => false, 'message' => 'Semua field metadata harus diisi.'];
        }

        $upload = $this->uploadModel->getUploadById($metadata['upload_id']);
        if (!$upload || $upload['status'] !== 'uploaded') {
            return ['success' => false, 'message' => 'Upload tidak valid.'];
        }

        // Validate for duplicates
        $validation = $this->uploadModel->validateMetadata(
            $metadata['upload_id'],
            $metadata['quarter'],
            $metadata['year']
        );

        if (!$validation['valid']) {
            return [
                'success' => false,
                'message' => $this->buildDuplicateErrorMessage($validation)
            ];
        }

        // Update metadata
        $this->uploadModel->update($metadata['upload_id'], [
            'upload_name' => $metadata['upload_name'],
            'quarter' => $metadata['quarter'],
            'year' => $metadata['year'],
            'usd_value' => $metadata['usd_value'],
            'status' => 'processing'
        ]);
---
UPDATE `uploads` SET `upload_name` = 'Data TW 3', `quarter` = '3', `year` = '2025', `usd_value` = '16653', `status` = 'processing'
WHERE `uploads`.`id` IN ('46')

    public function deleteUpload(string $uploadId): array
    {
        if (!$uploadId) {
            return ['success' => false, 'message' => 'ID upload tidak valid.'];
        }

        $upload = $this->uploadModel->getUploadById($uploadId);
        if (!$upload) {
            return ['success' => false, 'message' => 'Upload tidak ditemukan.'];
        }

        try {
            // Delete associated project data
            $this->projectModel->deleteProjectsByUpload($uploadId);

            // Delete upload record
            $this->uploadModel->delete($uploadId);
---
DELETE FROM `uploads`
WHERE `id` IN ('43')